master/app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT "books".* FROM "books" WHERE (title LIKE '%clrs%' OR author LIKE '%clrs%')

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("author", "created_at", "read", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Myself"], ["created_at", Mon, 04 Feb 2013 07:40:24 UTC +00:00], ["read", false], ["title", "CLRS"], ["updated_at", Mon, 04 Feb 2013 07:40:24 UTC +00:00]]

  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "books" SET "title" = 'Introduction to Algorithms', "author" = 'CLRS', "updated_at" = '2013-02-04 11:01:33.263177' WHERE "books"."id" = 18